src/cf/InformationRegisters/АналогиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>АналогиНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/АналогиНоменклатуры/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Если ОбратныйАналог Тогда
		МенеджерЗаписи=РегистрыСведений.АналогиНоменклатуры.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Номенклатура=ТекущийОбъект.Аналог;
		МенеджерЗаписи.Аналог=ТекущийОбъект.Номенклатура;
		МенеджерЗаписи.Количество=?(ТекущийОбъект.Количество=0, 0, 1/ТекущийОбъект.Количество);
		МенеджерЗаписи.Записать(Истина);
	КонецЕсли;
КонецПроцедуры
